Repository: onestudio-co/bond-core
Catalog: packages/form/lib/l10n/validator_messages_*.arb
Languages: ar

# requiredValidationMessage
source: {fieldName} is required.
ar: {fieldName} مطلوب.

# emailValidationMessage
source: {fieldName} must be a valid email address.
ar: {fieldName} يجب أن يكون عنوان بريد إلكتروني صالح.

# minValueValidationMessage
source: {fieldName} must have a minimum value of {value}.
ar: {fieldName} يجب أن يكون لديه قيمة دنيا {value}.

# maxValueValidationMessage
source: {fieldName} must have a maximum value of {value}.
ar: {fieldName} يجب أن يكون لديه قيمة عليا {value}.

# minLengthValidationMessage
source: {fieldName} must be at least {length} characters long.
ar: يجب أن يكون {fieldName} على الأقل {length} حروف.

# maxLengthValidationMessage
source: {fieldName} must not exceed {length} characters.
ar: لا يجب أن يتجاوز {fieldName} {length} حروف.

# inValuesValidationMessage
source: {fieldName} must be included in the given list of values.
ar: {fieldName} يجب أن يكون ضمن القائمة المعطاة.

# notInValuesValidationMessage
source: {fieldName} must not be included in the given list of values.
ar: {fieldName} يجب أن لا يكون ضمن القائمة المعطاة.

# integerValidationMessage
source: {fieldName} must be an integer.
ar: {fieldName} يجب أن يكون عددا صحيحا.

# numericValidationMessage
source: {fieldName} must be numeric.
ar: {fieldName} يجب أن يكون رقميا.

# digitsValidationMessage
source: {fieldName} must be numeric and have an exact length of {value}.
ar: {fieldName} يجب أن يكون رقميا وأن يكون طوله بالضبط {value}.

# digitsBetweenValidationMessage
source: {fieldName} must have a length between {min} and {max}.
ar: {fieldName} يجب أن يكون طوله بين {min} و{max}.

# sizeValidationMessage
source: {fieldName} must have a size of {value}.
ar: {fieldName} يجب أن يكون حجمه {value}.

# betweenValidationMessage
source: {fieldName} must have a size between {min} and {max}.
ar: {fieldName} يجب أن يكون حجمه بين {min} و{max}.

# booleanValidationMessage
source: {fieldName} must be a boolean (true, false, 1, 0, '1', '0').
ar: {fieldName} يجب أن يكون منطقيا (true, false, 1, 0, '1', '0').

# confirmedValidationMessage
source: {fieldName} confirmation does not match.
ar: لا يتطابق تأكيد {fieldName}.

# dateValidationMessage
source: {fieldName} must be a valid date.
ar: {fieldName} يجب أن يكون تاريخا صحيحا.

# dateFormatValidationMessage
source: {fieldName} must match the format {format}.
ar: {fieldName} يجب أن يتوافق مع النسق {format}.

# differentValidationMessage
source: {fieldName} must have a different value than {field}.
ar: {fieldName} يجب أن يكون له قيمة مختلفة عن {field}.

# sameValidationMessage
source: {fieldName} must have the same value as {field}.
ar: {fieldName} يجب أن يكون له نفس القيمة كـ {field}.

# alphaValidationMessage
source: {fieldName} must contain only alphabetic characters.
ar: {fieldName} يجب أن يحتوي فقط على أحرف أبجدية.

# alphaDashValidationMessage
source: {fieldName} may only contain alpha-numeric characters, dashes, and underscores.
ar: {fieldName} قد يحتوي فقط على أحرف أبجدية رقمية، شرطات، وشرطات سفلية.

# alphaNumValidationMessage
source: {fieldName} must contain only alpha-numeric characters.
ar: {fieldName} يجب أن يحتوي فقط على أحرف أبجدية رقمية.

# urlValidationMessage
source: {fieldName} must be a valid URL.
ar: {fieldName} يجب أن يكون عنوان URL صالح.

# regexValidationMessage
source: {fieldName} must match the given pattern.
ar: {fieldName} يجب أن يطابق النمط المحدد.

# maxSelectedValidationMessage
source: You may only select {max} {fieldName}.
ar: لا يمكنك تحديد أكثر من {max} خيارات لـ {fieldName}.

# minSelectedValidationMessage
source: You must select at least {min} {fieldName}.
ar: يجب عليك تحديد {min} خيارات لـ {fieldName}.

# rangeSelectedValidationMessage
source: You must select between {min} and {max} {fieldName}.
ar: يجب عليك تحديد بين {min} و {max} خيارات لـ {fieldName}.
